packages/archaea-simulation/archaea_simulation-1.1.14.tar.gz/archaea_simulation-1.1.14/archaea_simulation/cfd/case/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # run from this directory

source /opt/openfoam9/etc/bashrc

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication surfaceFeatures

runApplication blockMesh
runApplication snappyHexMesh -overwrite

runApplication $(getApplication)

simpleFoam -postProcess -func writeCellCentres
# simpleFoam -postProcess -func sample
simpleFoam -postProcess -func cutPlaneSurface

#------------------------------------------------------------------------------
